/*
Завдання 6: 
Оголосіть змінну  age, яка містить дату народження
Створіть програму яка виведе наступне повідомлення:
•	“Ви можете голосувати”, якщо age більше 18
•	“Ви можете голосувати через n років” в іншому випадку, де n – кількість років через яку особа зможе голосувати.

*/

const birthYear = 2012;

const age = 2025 - birthYear; //age = 2025 - 2012 = 13

if (age > 18) {
  // 13 > 18 = false
  console.log("Ви можете голосувати");
  // умова справджується
} else {
  const yearsToVote = 18 - age;
  console.log(`Ви можете голосувати через ${yearsToVote} років`);
  // умова не справджується
}

/*
Оголосіть змінну  temperature , яка містить температуру
Створіть програму яка виведе наступне повідомлення:
•	“Надворі жарко”, якщо temperature більша 30
•	“Надворі тепло”, якщо temperature більша 20
•	“Надворі прохолодно”, якщо temperature більша 10
•	“Надворі холодно”, якщо temperature менша 10
*/

const temperature = 5;

if (temperature > 30) { // 5 > 30 = false
  console.log("Надворі жарко");
} else if (temperature > 20) { // 5 > 20 = false
  console.log("Надворі тепло");
} else if (temperature > 10) { // 5 > 10 = false
  console.log("Надворі прохолодно");
} else {
  console.log("Надворі холодно");
}
